// Задача 38: Задайте массив натуральных чисел. Найдите разницу между максимальным и минимальным элементов массива.

// [3 7 22 2 78] -> 76

System.Console.WriteLine("Insert array size");
int myArraysize = Convert.ToInt32(Console.ReadLine());
int[] myArray = {3, 7, 22, 2, 78};
int max = 0;
int min = 0;
for(int i = 0; )